{
    "descriptions": {
        "code": [
            "I started to code when i was 14 years old and i vivdly remember the excitement that accompanied me when i first opened the Swift Playgrounds app on my iPad and felt a huge world unfold as i discovered what it meant to create things with code.",
            "Since then my love for the very nerdy concepts of Computer Science and the ability to create things in the world of bits that make people feel and live better in the world of atoms is a promise that lives as one of the most idealistic and utterly beautiful of our era."
        ],
        "am": [
            "I am a human person and i am 17 years old. I am a pretty nerdy high school teenager from northern Mexico (Dog city, to be precise) and have strong interests in computer science, physics, and philosophy. From this it might be inferred i love intelectual travel so i dare include that i also love physical travel and bodily locomotion (running). I was born February the 19th 2002. ",
            "When it comes to human languages, i am fluent in English and Spanish, some German, bit of french, and i am a beginner in Chinese. When it comes to computer languages, i am fluent in JS, pretty well on Python and Swift, and i am a beginner in Dart."
        ],
        "write": [
            "For me writing has always been of really crucial service as a means of introspection, analysis, and idea generation as well as divulgation. Writing is a resource that seldom fails to bring clarity into my world, and in doing so i find it inexorable to me being me. In that way i think it has a very transversal role in my life for it manifests itself in all my dwellings; clarity is never in excess. So although coding is in a way also writing and i think my delight in both is no coincidence, i think the sunset of my life might come the day i choose it is not worth it to keep moving the pen."
        ],
        "none": [
            ""
        ]
    },
    "contact": {
        "description": [
            "You may contact me for whatever reason. Don't hesitate, i dont bite!"
        ],
        "contactInfo": [
            [
                "Mail",
                "acosta_jf@icloud.com"
            ],
            [
                "Github",
                "FelipeAcosta02"
            ]
        ]
    },
    "code": [
        "I started coding when i was"
    ],
    "write": [
        "I started coding when i was"
    ],
    "am": [
        "I started coding when i was"
    ]
}